Revit 2026 API

# SpaceCeilingReflectance Property

---

Get or set the Ceiling Reflectance of the Space.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double CeilingReflectance { get; set; }
```
```vb
Public Property CeilingReflectance As Double
	Get
	Set
```
```cpp
public:
property double CeilingReflectance {
	double get ();
	void set (double value);
}
```
```fsharp
member CeilingReflectance : float with get, set
```

#### Property Value

Double

This property is used to get or set the Ceiling Reflectance of the Space.

#### Reference

Space Class

Autodesk.Revit.DB.Mechanical Namespace